{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          0
        ],
        "tokens": [
          "[CLS]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[CLS]": 0,
      "[MASK]": 1,
      "[PAD]": 2,
      "[UNK]": 3,
      "A": 4,
      "C": 5,
      "D": 6,
      "E": 7,
      "F": 8,
      "G": 9,
      "H": 10,
      "I": 11,
      "K": 12,
      "L": 13,
      "M": 14,
      "N": 15,
      "P": 16,
      "Q": 17,
      "R": 18,
      "S": 19,
      "T": 20,
      "V": 21,
      "W": 22,
      "Y": 23,
      "LL": 24,
      "AA": 25,
      "SS": 26,
      "AL": 27,
      "SL": 28,
      "VL": 29,
      "EE": 30,
      "GG": 31,
      "GL": 32,
      "TL": 33,
      "EL": 34,
      "RL": 35,
      "IL": 36,
      "KL": 37,
      "AV": 38,
      "DL": 39,
      "SG": 40,
      "PL": 41,
      "AG": 42,
      "VV": 43,
      "KK": 44,
      "QL": 45,
      "AS": 46,
      "FL": 47,
      "PP": 48,
      "RR": 49,
      "AE": 50,
      "NL": 51,
      "TV": 52,
      "TG": 53,
      "SV": 54,
      "AI": 55,
      "KE": 56,
      "PG": 57,
      "DG": 58,
      "AR": 59,
      "AT": 60,
      "SI": 61,
      "SE": 62,
      "SP": 63,
      "ST": 64,
      "DV": 65,
      "DE": 66,
      "SR": 67,
      "DI": 68,
      "KV": 69,
      "YL": 70,
      "PE": 71,
      "PV": 72,
      "KI": 73,
      "KG": 74,
      "AQ": 75,
      "AF": 76,
      "NG": 77,
      "TT": 78,
      "SF": 79,
      "KR": 80,
      "QQ": 81,
      "NI": 82,
      "TI": 83,
      "HL": 84,
      "AD": 85,
      "SQ": 86,
      "RE": 87,
      "AP": 88,
      "NV": 89,
      "TE": 90,
      "SD": 91,
      "RG": 92,
      "RV": 93,
      "IG": 94,
      "AK": 95,
      "ML": 96,
      "IV": 97,
      "NN": 98,
      "FG": 99,
      "FV": 100,
      "QE": 101,
      "SK": 102,
      "NE": 103,
      "TP": 104,
      "QV": 105,
      "IE": 106,
      "QG": 107,
      "YG": 108,
      "DD": 109,
      "RI": 110,
      "SN": 111,
      "YV": 112,
      "DP": 113,
      "AN": 114,
      "FI": 115,
      "FE": 116,
      "CL": 117,
      "KP": 118,
      "KD": 119,
      "SY": 120,
      "KT": 121,
      "AM": 122,
      "AY": 123,
      "II": 124,
      "RP": 125,
      "SH": 126,
      "EV": 127,
      "GV": 128,
      "AH": 129,
      "NP": 130,
      "RD": 131,
      "KQ": 132,
      "TF": 133,
      "TD": 134,
      "KN": 135,
      "RQ": 136,
      "EG": 137,
      "MV": 138,
      "WL": 139,
      "CG": 140,
      "TQ": 141,
      "FF": 142,
      "TR": 143,
      "YE": 144,
      "HG": 145,
      "ME": 146,
      "MG": 147,
      "HV": 148,
      "IP": 149,
      "SC": 150,
      "FD": 151,
      "TN": 152,
      "KY": 153,
      "ID": 154,
      "QP": 155,
      "RN": 156,
      "FP": 157,
      "AC": 158,
      "VG": 159,
      "TY": 160,
      "SM": 161,
      "QI": 162,
      "RK": 163,
      "RY": 164,
      "RF": 165,
      "HP": 166,
      "VE": 167,
      "RT": 168,
      "LLL": 169,
      "ND": 170,
      "QD": 171,
      "KF": 172,
      "YI": 173,
      "SA": 174,
      "HE": 175,
      "SW": 176,
      "CV": 177,
      "DF": 178,
      "NQ": 179,
      "TK": 180,
      "HI": 181,
      "QR": 182,
      "YP": 183,
      "GE": 184,
      "YD": 185,
      "NF": 186,
      "MI": 187,
      "AW": 188,
      "YF": 189,
      "NT": 190,
      "ALL": 191,
      "PD": 192,
      "MD": 193,
      "TC": 194,
      "RH": 195,
      "PI": 196,
      "TH": 197,
      "TS": 198,
      "ED": 199,
      "EI": 200,
      "VI": 201,
      "NK": 202,
      "GI": 203,
      "QK": 204,
      "NY": 205,
      "MP": 206,
      "AAL": 207,
      "NR": 208,
      "SLL": 209,
      "SSL": 210,
      "FY": 211,
      "FQ": 212,
      "KH": 213,
      "RC": 214,
      "VD": 215,
      "VP": 216,
      "YY": 217,
      "TM": 218,
      "EK": 219,
      "GD": 220,
      "EEL": 221,
      "HH": 222,
      "IF": 223,
      "QN": 224,
      "KC": 225,
      "RM": 226,
      "KM": 227,
      "QT": 228,
      "WG": 229,
      "FT": 230,
      "RS": 231,
      "EP": 232,
      "KS": 233,
      "QY": 234,
      "CP": 235,
      "QH": 236,
      "FN": 237,
      "GP": 238,
      "WV": 239,
      "IT": 240,
      "CE": 241,
      "DR": 242,
      "QF": 243,
      "IN": 244,
      "DY": 245,
      "TA": 246,
      "KA": 247,
      "ER": 248,
      "FR": 249,
      "DT": 250,
      "IY": 251,
      "NH": 252,
      "IR": 253,
      "QM": 254,
      "FS": 255,
      "ASL": 256,
      "AVL": 257,
      "DN": 258,
      "DK": 259,
      "IK": 260,
      "TW": 261,
      "IQ": 262,
      "HR": 263,
      "AGL": 264,
      "EQ": 265,
      "NS": 266,
      "YR": 267,
      "PF": 268,
      "PR": 269,
      "AGG": 270,
      "PQ": 271,
      "NM": 272,
      "PT": 273,
      "DQ": 274,
      "GF": 275,
      "HQ": 276,
      "VT": 277,
      "SGG": 278,
      "YQ": 279,
      "HF": 280,
      "ASS": 281,
      "GR": 282,
      "MT": 283,
      "AEL": 284,
      "WE": 285,
      "CI": 286,
      "VF": 287,
      "VR": 288,
      "MR": 289,
      "CD": 290,
      "HY": 291,
      "SAL": 292,
      "MK": 293,
      "HD": 294,
      "LLG": 295,
      "EN": 296,
      "GGL": 297,
      "YT": 298,
      "SAA": 299,
      "CR": 300,
      "FK": 301,
      "VQ": 302,
      "ET": 303,
      "YN": 304,
      "VK": 305,
      "MN": 306,
      "ATL": 307,
      "GT": 308,
      "SVL": 309,
      "MQ": 310,
      "SGL": 311,
      "HT": 312,
      "MF": 313,
      "WI": 314,
      "AIL": 315,
      "ARL": 316,
      "YK": 317,
      "PN": 318,
      "ASG": 319,
      "PK": 320,
      "AAG": 321,
      "LLE": 322,
      "VN": 323,
      "IS": 324,
      "CC": 325,
      "ADL": 326,
      "DS": 327,
      "PS": 328,
      "GQ": 329,
      "AEE": 330,
      "LLV": 331,
      "IH": 332,
      "CF": 333,
      "GY": 334,
      "PY": 335,
      "DM": 336,
      "GK": 337,
      "CQ": 338,
      "CT": 339,
      "FH": 340,
      "RW": 341,
      "GN": 342,
      "EEE": 343,
      "KW": 344,
      "DH": 345,
      "MM": 346,
      "VY": 347,
      "STL": 348,
      "GGG": 349,
      "TGE": 350,
      "AKL": 351,
      "AAV": 352,
      "PH": 353,
      "WD": 354,
      "SIL": 355,
      "ALG": 356,
      "EF": 357,
      "ALV": 358,
      "SEL": 359,
      "AQL": 360,
      "AFL": 361,
      "SSG": 362,
      "YH": 363,
      "APL": 364,
      "IM": 365,
      "APG": 366,
      "NC": 367,
      "RLL": 368,
      "ALE": 369,
      "SAS": 370,
      "FC": 371,
      "SLG": 372,
      "ATV": 373,
      "KEL": 374,
      "ATG": 375,
      "KLL": 376,
      "VLV": 377,
      "SRL": 378,
      "IC": 379,
      "ARR": 380,
      "TLL": 381,
      "DW": 382,
      "APP": 383,
      "EY": 384,
      "MY": 385,
      "SPL": 386,
      "VLG": 387,
      "SSV": 388,
      "SAV": 389,
      "SLV": 390,
      "WR": 391,
      "SDL": 392,
      "AKK": 393,
      "HN": 394,
      "SEE": 395,
      "WQ": 396,
      "PC": 397,
      "SKL": 398,
      "SFL": 399,
      "VLE": 400,
      "AAE": 401,
      "AVV": 402,
      "AGV": 403,
      "DC": 404,
      "HC": 405,
      "SLE": 406,
      "YC": 407,
      "FM": 408,
      "ADG": 409,
      "SVV": 410,
      "KKL": 411,
      "AKE": 412,
      "FW": 413,
      "PM": 414,
      "KAL": 415,
      "SQL": 416,
      "QC": 417,
      "TSS": 418,
      "WN": 419,
      "ELE": 420,
      "ASV": 421,
      "GLV": 422,
      "SAG": 423,
      "LLP": 424,
      "GLG": 425,
      "WP": 426,
      "SLP": 427,
      "ANL": 428,
      "HK": 429,
      "SPG": 430,
      "PPP": 431,
      "LLD": 432,
      "ADV": 433,
      "TAA": 434,
      "SNL": 435,
      "ADI": 436,
      "SSP": 437,
      "APV": 438,
      "WT": 439,
      "NNNN": 440,
      "EM": 441,
      "PPG": 442,
      "CN": 443,
      "AKV": 444,
      "ILG": 445,
      "SAI": 446,
      "EH": 447,
      "AVG": 448,
      "APE": 449,
      "REL": 450,
      "TLV": 451,
      "SSSS": 452,
      "STV": 453,
      "WF": 454,
      "TSL": 455,
      "YM": 456,
      "TAL": 457,
      "QLL": 458,
      "VVV": 459,
      "CH": 460,
      "RRL": 461,
      "TVL": 462,
      "KTL": 463,
      "SRR": 464,
      "MH": 465,
      "RAL": 466,
      "AKG": 467,
      "SGV": 468,
      "FLL": 469,
      "SAE": 470,
      "EEV": 471,
      "STG": 472,
      "KSL": 473,
      "ILV": 474,
      "NW": 475,
      "DLV": 476,
      "QQQQ": 477,
      "RLV": 478,
      "ANG": 479,
      "AYL": 480,
      "ILL": 481,
      "SPP": 482,
      "DLE": 483,
      "SKK": 484,
      "GLE": 485,
      "TLG": 486,
      "AAAA": 487,
      "CY": 488,
      "RLE": 489,
      "SAT": 490,
      "KEE": 491,
      "DLL": 492,
      "PLP": 493,
      "QW": 494,
      "ILE": 495,
      "SKE": 496,
      "QAL": 497,
      "AKR": 498,
      "RSL": 499,
      "TGL": 500,
      "KVL": 501,
      "KLV": 502,
      "ADE": 503,
      "HM": 504,
      "ELV": 505,
      "PLV": 506,
      "RLG": 507,
      "AVE": 508,
      "KLE": 509,
      "NLL": 510,
      "RVL": 511
    },
    "merges": [
      "L L",
      "A A",
      "S S",
      "A L",
      "S L",
      "V L",
      "E E",
      "G G",
      "G L",
      "T L",
      "E L",
      "R L",
      "I L",
      "K L",
      "A V",
      "D L",
      "S G",
      "P L",
      "A G",
      "V V",
      "K K",
      "Q L",
      "A S",
      "F L",
      "P P",
      "R R",
      "A E",
      "N L",
      "T V",
      "T G",
      "S V",
      "A I",
      "K E",
      "P G",
      "D G",
      "A R",
      "A T",
      "S I",
      "S E",
      "S P",
      "S T",
      "D V",
      "D E",
      "S R",
      "D I",
      "K V",
      "Y L",
      "P E",
      "P V",
      "K I",
      "K G",
      "A Q",
      "A F",
      "N G",
      "T T",
      "S F",
      "K R",
      "Q Q",
      "N I",
      "T I",
      "H L",
      "A D",
      "S Q",
      "R E",
      "A P",
      "N V",
      "T E",
      "S D",
      "R G",
      "R V",
      "I G",
      "A K",
      "M L",
      "I V",
      "N N",
      "F G",
      "F V",
      "Q E",
      "S K",
      "N E",
      "T P",
      "Q V",
      "I E",
      "Q G",
      "Y G",
      "D D",
      "R I",
      "S N",
      "Y V",
      "D P",
      "A N",
      "F I",
      "F E",
      "C L",
      "K P",
      "K D",
      "S Y",
      "K T",
      "A M",
      "A Y",
      "I I",
      "R P",
      "S H",
      "E V",
      "G V",
      "A H",
      "N P",
      "R D",
      "K Q",
      "T F",
      "T D",
      "K N",
      "R Q",
      "E G",
      "M V",
      "W L",
      "C G",
      "T Q",
      "F F",
      "T R",
      "Y E",
      "H G",
      "M E",
      "M G",
      "H V",
      "I P",
      "S C",
      "F D",
      "T N",
      "K Y",
      "I D",
      "Q P",
      "R N",
      "F P",
      "A C",
      "V G",
      "T Y",
      "S M",
      "Q I",
      "R K",
      "R Y",
      "R F",
      "H P",
      "V E",
      "R T",
      "LL L",
      "N D",
      "Q D",
      "K F",
      "Y I",
      "S A",
      "H E",
      "S W",
      "C V",
      "D F",
      "N Q",
      "T K",
      "H I",
      "Q R",
      "Y P",
      "G E",
      "Y D",
      "N F",
      "M I",
      "A W",
      "Y F",
      "N T",
      "A LL",
      "P D",
      "M D",
      "T C",
      "R H",
      "P I",
      "T H",
      "T S",
      "E D",
      "E I",
      "V I",
      "N K",
      "G I",
      "Q K",
      "N Y",
      "M P",
      "AA L",
      "N R",
      "S LL",
      "SS L",
      "F Y",
      "F Q",
      "K H",
      "R C",
      "V D",
      "V P",
      "Y Y",
      "T M",
      "E K",
      "G D",
      "EE L",
      "H H",
      "I F",
      "Q N",
      "K C",
      "R M",
      "K M",
      "Q T",
      "W G",
      "F T",
      "R S",
      "E P",
      "K S",
      "Q Y",
      "C P",
      "Q H",
      "F N",
      "G P",
      "W V",
      "I T",
      "C E",
      "D R",
      "Q F",
      "I N",
      "D Y",
      "T A",
      "K A",
      "E R",
      "F R",
      "D T",
      "I Y",
      "N H",
      "I R",
      "Q M",
      "F S",
      "A SL",
      "A VL",
      "D N",
      "D K",
      "I K",
      "T W",
      "I Q",
      "H R",
      "A GL",
      "E Q",
      "N S",
      "Y R",
      "P F",
      "P R",
      "A GG",
      "P Q",
      "N M",
      "P T",
      "D Q",
      "G F",
      "H Q",
      "V T",
      "S GG",
      "Y Q",
      "H F",
      "A SS",
      "G R",
      "M T",
      "A EL",
      "W E",
      "C I",
      "V F",
      "V R",
      "M R",
      "C D",
      "H Y",
      "S AL",
      "M K",
      "H D",
      "LL G",
      "E N",
      "GG L",
      "Y T",
      "S AA",
      "C R",
      "F K",
      "V Q",
      "E T",
      "Y N",
      "V K",
      "M N",
      "A TL",
      "G T",
      "S VL",
      "M Q",
      "S GL",
      "H T",
      "M F",
      "W I",
      "A IL",
      "A RL",
      "Y K",
      "P N",
      "A SG",
      "P K",
      "AA G",
      "LL E",
      "V N",
      "I S",
      "C C",
      "A DL",
      "D S",
      "P S",
      "G Q",
      "A EE",
      "LL V",
      "I H",
      "C F",
      "G Y",
      "P Y",
      "D M",
      "G K",
      "C Q",
      "C T",
      "F H",
      "R W",
      "G N",
      "EE E",
      "K W",
      "D H",
      "M M",
      "V Y",
      "S TL",
      "GG G",
      "TG E",
      "A KL",
      "AA V",
      "P H",
      "W D",
      "S IL",
      "AL G",
      "E F",
      "AL V",
      "S EL",
      "A QL",
      "A FL",
      "SS G",
      "Y H",
      "A PL",
      "I M",
      "A PG",
      "N C",
      "R LL",
      "AL E",
      "S AS",
      "F C",
      "SL G",
      "A TV",
      "K EL",
      "A TG",
      "K LL",
      "VL V",
      "S RL",
      "I C",
      "A RR",
      "T LL",
      "D W",
      "A PP",
      "E Y",
      "M Y",
      "S PL",
      "VL G",
      "SS V",
      "S AV",
      "SL V",
      "W R",
      "S DL",
      "A KK",
      "H N",
      "S EE",
      "W Q",
      "P C",
      "S KL",
      "S FL",
      "VL E",
      "AA E",
      "AV V",
      "AG V",
      "D C",
      "H C",
      "SL E",
      "Y C",
      "F M",
      "A DG",
      "S VV",
      "K KL",
      "A KE",
      "F W",
      "P M",
      "K AL",
      "S QL",
      "Q C",
      "T SS",
      "W N",
      "EL E",
      "AS V",
      "GL V",
      "S AG",
      "LL P",
      "GL G",
      "W P",
      "SL P",
      "A NL",
      "H K",
      "S PG",
      "PP P",
      "LL D",
      "A DV",
      "T AA",
      "S NL",
      "A DI",
      "SS P",
      "A PV",
      "W T",
      "NN NN",
      "E M",
      "PP G",
      "C N",
      "A KV",
      "IL G",
      "S AI",
      "E H",
      "AV G",
      "A PE",
      "R EL",
      "TL V",
      "SS SS",
      "S TV",
      "W F",
      "T SL",
      "Y M",
      "T AL",
      "Q LL",
      "VV V",
      "C H",
      "R RL",
      "T VL",
      "K TL",
      "S RR",
      "M H",
      "R AL",
      "A KG",
      "SG V",
      "F LL",
      "S AE",
      "EE V",
      "S TG",
      "K SL",
      "IL V",
      "N W",
      "DL V",
      "QQ QQ",
      "RL V",
      "A NG",
      "A YL",
      "I LL",
      "S PP",
      "DL E",
      "S KK",
      "GL E",
      "TL G",
      "AA AA",
      "C Y",
      "RL E",
      "S AT",
      "K EE",
      "D LL",
      "PL P",
      "Q W",
      "IL E",
      "S KE",
      "Q AL",
      "A KR",
      "R SL",
      "T GL",
      "K VL",
      "KL V",
      "A DE",
      "H M",
      "EL V",
      "PL V",
      "RL G",
      "AV E",
      "KL E",
      "N LL",
      "R VL"
    ]
  }
}